W11D4/bench_bnb/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "123"], ["LIMIT", 1]]
---
  def self.find_by_credentails(username, password)
    user = User.find_by(username: username)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "AC6_8Buyu34TJBfdLiDgXA"], ["updated_at", "2021-02-05 00:59:11.461940"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = SecureRandom::urlsafe_base64
    self.save!